Repository: 84000/data-translation-memory
Catalog: Toh_97-The_Chapter_on_Manjusris_Magical_Display-v1.tmx
Source language: bo
Languages: en

source: འཕགས་པ་འཇམ་དཔལ་རྣམ་པར་འཕྲུལ་པའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Chapter on Mañjuśrī’s Magical Display

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was residing in Śrāvastī, in the Jeta Grove, the park of Anāthapiṇḍada, together with a great monastic assembly of 1,250 monks.

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་དང་། འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པ་དང་། གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དུ་མ་དག་དང་ཡང་ཐབས་ཅིག་གོ། །
en: Also in attendance was a great assembly of bodhisattvas, as well as gods of the desire realm, gods of the form realm, and various gods of the pure abodes.

source: དེ་ན་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ནས་ཆོས་སྟོན་ཏོ། །
en: There, surrounded and revered by his retinue of many hundreds of thousands, the Blessed One was teaching the Dharma.

source: དེའི་ཚེ་ལྷའི་བུ་འོད་མང་པོ་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ །
en: Present in the assembly at that time was a divine being known as Great Light.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཡང་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ། །
en: Also present in the assembly was youthful Mañjuśrī.

source: དེ་ནས་ལྷའི་བུ་འོད་མང་པོས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The god Great Light asked youthful Mañjuśrī,

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བདུད་བར་ཆད་བྱེད་ན། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདུད་ཀྱི་ལས་གང་ཡིན།
en: “Mañjuśrī, when Māra creates obstacles to the bodhisattvas’ unexcelled and perfect awakening, then, Mañjuśrī, what are the workings of Māra with respect to bodhisattvas?”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ལྷའི་བུ་འོད་མང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Youthful Mañjuśrī replied to the god Great Light,

source: ལྷའི་བུ་ཇི་ཙམ་དུ་ལས་རྣམས་འབྱུང་བ་དེ་ཙམ་དུ་བདུད་ཀྱི་ལས་སོ། །
en: “Divine being, as long as there are actions, there are the workings of Māra.

source: ཇི་ཙམ་དུ་སྨོན་པ་དང་། ཇི་ཙམ་དུ་ལོག་པར་འཛིན་པ་དང་། ཇི་ཙམ་དུ་མཆོག་ཏུ་འཛིན་པ་དེ་ཙམ་དུ་བདུད་ཀྱི་ལས་སོ། །
en: As long as there are aspirations, misapprehensions, or valuations, there are the workings of Māra.

source: ཇི་ཙམ་དུ་འདོད་པ་དང་། ཇི་ཙམ་དུ་འདུ་ཤེས་པ་དང་། ཇི་ཙམ་དུ་རློམ་སེམས་པ་དང་། ཇི་ཙམ་དུ་ཡོངས་སུ་རྟོགས་པ་དེ་ཙམ་དུ་བདུད་ཀྱི་ལས་སོ། །
en: As long as there are desires, conceptions, assumptions, or superimpositions, there are the workings of Māra.

source: ལྷའི་བུ་གཞན་ཡང་བྱང་ཆུབ་ཀྱི་སེམས་ལ་མངོན་པར་ཞེན་པ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: Also, divine being, clinging to the mind of awakening is the working of Māra.

source: སྦྱིན་པའི་སེམས་ལ་མངོན་པར་ཞེན་པ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: Clinging to an attitude of generosity is the working of Māra.

source: ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱི་སེམས་ལ་མངོན་པར་ཞེན་པ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: Clinging to thoughts of discipline, patience, diligence, concentration, and insight is also the working of Māra.

source: སྦྱིན་པ་རློམ་སེམས་སུ་བྱེད་པ་དང་། ཚུལ་ཁྲིམས་མཆོག་ཏུ་འཛིན་པ་དང་། བཟོད་པ་འཛིན་པ་དང་། བརྩོན་འགྲུས་ལེན་པ་དང་། བསམ་གཏན་ལ་མཚན་མ་དང་། ཤེས་རབ་རྒྱུ་བ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: Being arrogant about generosity, esteeming discipline, grasping at patience, adopting diligence, practicing concentration with marks, and having discursive insight are also the workings of Māra.

source: དགོན་པ་ལ་དགའ་ཞིང་མོས་པའི་སེམས་དང་། བཏང་སྙོམས་སུ་ལྷུང་བ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: Liking and wishing for the wilderness and falling into indifference are also the workings of Māra.

source: འདོད་པ་ཉུང་བ་དང་། ཆོག་ཤེས་པ་དང་། སྦྱངས་པའི་ཡོན་ཏན་དང་། ཡོ་བྱད་བསྙུངས་པ་རློམ་སེམས་སུ་བྱེད་པ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: Entertaining assumptions about having few desires, being content, engaging in ascetic practices, and reducing one’s possessions is also the working of Māra.

source: བདག་ནི་སྟོང་པ་ཉིད་ལ་གནས་པ། བདག་ནི་མཚན་མ་མེད་པ་ལ་གནས་པ། བདག་ནི་སྨོན་པ་མེད་པ་ལ་གནས་པ། བདག་ནི་སྤྲོས་པ་མེད་པ་ལ་གནས་པ། བདག་ནི་དེ་བཞིན་གཤེགས་པའི་བཀའ་བསྒྲུབ་ཅིང་གནས་པའོ་སྙམ་དུ་རློམ་སེམས་སུ་བྱེད་ཅིང་རྣམ་པར་རྟོག་པ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: To have assumptions and presumptions, such as ‘I abide in emptiness,’ ‘I rest free from marks,’ ‘I rest without wishes,’ ‘I rest without conceptual elaborations,’ and ‘I have obtained and adhere to the instructions of the Thus-Gone One,’ is also the working of Māra.

source: ལྷའི་བུ་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པ་དང་། མཐོང་བ་དང་། ཐོས་པ་དང་། བྱེ་བྲག་ཕྱེད་པ་དང་། རྣམ་པར་ཤེས་པའི་གནས་ཇི་ཙམ་པ་དེ་ཙམ་དུ་བདུད་ཀྱི་ལས་སོ། །
en: Divine being, as long as there are objects of thought, imagination, superimposition, sight, hearing, discrimination, or cognition, there are the workings of Māra.”

source: ལྷའི་བུས་སྨྲས་པ།
en: The god asked,

source: འཇམ་དཔལ་བདུད་ཀྱི་ལས་ག་ལས་འབྱུང་།
en: “Mañjuśrī, from where do the workings of Māra arise?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Mañjuśrī responded,

source: ལྷའི་བུ་བདུད་ཀྱི་ལས་ནི་བརྩོན་པ་ལས་འབྱུང་ངོ་། །
en: “Divine being, the workings of Māra arise from exertion.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: ལྷའི་བུ་བརྩོན་པ་ལ་བདུད་ཀྱི་གླགས་ཚོལ་གྱི་མི་བརྩོན་པ་ལ་བདུད་ཀྱིས་ཅི་ཞིག་བྱ་བར་འགྱུར་ཏེ།
en: Divine being, in exertion, there is an opportunity for Māra. On the other hand, what could Māra accomplish with nonexertion?

source: དེ་ཉིད་བདུད་ཀྱི་ལས་ཡིན་ནོ། །
en: So exertion itself is the working of Māra.”

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་ཇི་ལྟར་ན་བརྩོན་པ་ཡིན། ཇི་ལྟར་ན་མི་བརྩོན་པ་ཡིན།
en: “Mañjuśrī, how do bodhisattvas exert themselves, and how do they not exert themselves?”

source: ལྷའི་བུ་ཇི་ཙམ་དུ་གཉིས་ལ་སྦྱོར་བ་དེ་ཙམ་དུ་བརྩོན་པ་མ་ཡིན་ནོ། །
en: “Divine being, even while they are engaged with duality, they are not exerting themselves.

source: འཇིག་རྟེན་གནས་པ་ནི་གཉིས་ལ་སྦྱོར་བ་དང་ལྡན་པའོ། །
en: To abide in the world is to have engagement with duality.

source: ལྷའི་བུ་བརྩོན་པ་ཞེས་བྱ་བ་འདི་ནི་སྦྱོར་བ་ཡང་དག་པའི་ཚིག་བླ་དགས་སོ། །
en: Divine being, exertion is a synonym for proper engagement.

source: སྦྱོར་བ་ཡང་དག་པ་ཞེས་བྱ་བ་འདི་ནི་སྦྱོར་བ་མེད་པའི་ཚིག་བླ་དགས་སོ། །
en: Proper engagement is a synonym for nonengagement.

source: སྦྱོར་བ་མེད་པ་ཞེས་བྱ་བ་འདི་ནི་སྤྲོས་པ་མེད་པའི་ཚིག་བླ་དགས་སོ། །
en: Nonengagement is a synonym for the absence of conceptual elaboration.

source: སྤྲོས་པ་མེད་པ་ཞེས་བྱ་བ་འདི་ནི་སྦྱོར་བ་ཡང་དག་པའི་ཚིག་བླ་དགས་སོ། །
en: Absence of conceptual elaboration is a synonym for proper engagement.

source: ལྷའི་བུ་གང་ན་མིག་ལ་མི་སྦྱོར་བ་དང་། གཟུགས་ལ་མི་སྦྱོར་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྦྱོར་བ་ཡང་དག་པ་ཞེས་བྱའོ། །
en: “Divine being, not engaging with the eyes or form is known as the proper engagement of bodhisattvas.

source: གང་ན་རྣ་བ་ལ་མི་སྦྱོར་བ་དང་། སྒྲ་ལ་མི་སྦྱོར་བ་དང་། སྣ་ལ་མི་སྦྱོར་བ་དང་། དྲི་ལ་མི་སྦྱོར་བ་དང་། ལྕེ་ལ་མི་སྦྱོར་བ་དང་། རོ་ལ་མི་སྦྱོར་བ་དང་། ལུས་ལ་མི་སྦྱོར་བ་དང་། རེག་བྱ་ལ་མི་སྦྱོར་བ་དང་། ཡིད་ལ་མི་སྦྱོར་བ་དང་། ཆོས་ལ་མི་སྦྱོར་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྦྱོར་བ་ཡང་དག་པ་ཞེས་བྱའོ། །
en: Not engaging with the ear or sound, the nose or smell, the tongue or taste, the body or texture, or the mind or mental phenomena is known as the proper engagement of bodhisattvas.

source: ལྷའི་བུ་གཞན་ཡང་ཉོན་མོངས་པ་ཐམས་ཅད་ལ་ཡང་མི་སྦྱོར་ལ།
en: Divine being, moreover, bodhisattvas do not engage with any affliction,

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སྤང་བའི་ཕྱིར་ཡང་བརྩོན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྦྱོར་བ་ཡང་དག་པ་ཞེས་བྱའོ། །
en: yet they exert themselves for the sake of eliminating the afflictions of beings. This is known as the proper engagement of bodhisattvas.

source: ལྷའི་བུ་གཞན་ཡང་ཁམས་གསུམ་པ་ཐམས་ཅད་ལ་ཡང་མི་སྦྱོར་ལ། ཁམས་གསུམ་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཀྱང་འབྱུང་བར་སྦྱོར་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྦྱོར་བ་ཡང་དག་པ་ཞེས་བྱའོ། །
en: Divine being, moreover, bodhisattvas do not engage with the three realms, yet they engage with the beings who appear within the three realms. This is known as the proper engagement of bodhisattvas.

source: གཞན་ཡང་སྦྱིན་པ་ལ་རློམ་སེམས་མེད་པར་ཡང་སྦྱོར་ལ། སེམས་ཅན་སེར་སྣ་ཅན་སྡུད་པར་ཡང་སྦྱོར་བ་དང་།
en: “Moreover, bodhisattvas engage in generosity free from arrogance, yet they also engage in attracting miserly beings.

source: ཚུལ་ཁྲིམས་ལ་རློམ་སེམས་མེད་པར་ཡང་སྦྱོར་ལ། སེམས་ཅན་ཚུལ་ཁྲིམས་འཆལ་པ་སྡུད་པར་ཡང་སྦྱོར་བ་དང་།
en: They engage in discipline without arrogance, yet they also engage in attracting immoral beings.

source: བཟོད་པ་ལ་རློམ་སེམས་མེད་པར་ཡང་སྦྱོར་ལ། སེམས་ཅན་གནོད་སེམས་ཅན་སྡུད་པར་ཡང་སྦྱོར་བ་དང་།
en: They engage in patience without arrogance, yet they also engage in attracting vindictive beings.

source: བརྩོན་འགྲུས་ལ་རློམ་སེམས་མེད་པར་ཡང་སྦྱོར་ལ། སེམས་ཅན་ལེ་ལོ་ཅན་སྡུད་པར་ཡང་སྦྱོར་བ་དང་།
en: They engage in diligence without arrogance, yet they also engage in attracting lazy beings.

source: བསམ་གཏན་ལ་རློམ་སེམས་མེད་པར་ཡང་སྦྱོར་ལ། སེམས་ཅན་སེམས་རྣམ་པར་གཡེངས་པ་སྡུད་པར་ཡང་སྦྱོར་བ་དང་།
en: They engage in concentration without arrogance, yet they also engage in attracting distracted beings.

source: ཤེས་རབ་ལ་རློམ་སེམས་མེད་པར་ཡང་སྦྱོར་ལ། སེམས་ཅན་ཤེས་རབ་འཆལ་པ་ཅན་སྡུད་པར་ཡང་སྦྱོར་བ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྦྱོར་བ་ཡང་དག་པ་ཞེས་བྱའོ། །
en: They engage in insight without arrogance, yet they also engage in attracting ignorant beings. These, too, are known as the proper engagement of bodhisattvas.

source: གཞན་ཡང་སྟོང་པ་ཉིད་ལ་རློམ་སེམས་མེད་པར་ཡང་སྦྱོར་ལ།
en: “Moreover, bodhisattvas engage in emptiness without arrogance.

source: ལྟ་བར་སོང་བ་ཐམས་ཅད་དང་ཡང་བྲལ་ཞིང་ལྟ་བར་སོང་བ་ལས་རྣམ་པར་གྲོལ་བ་ཡང་མ་ཡིན་པ་ནི་སྟོང་པ་ཉིད་ལ་སྦྱོར་བ་སྟེ།
en: The absence of any view, while also not being free from views, is to engage in emptiness.

source: སྟོང་པ་ཉིད་གང་གིས་སྟོང་པ་ཉིད་སྟོང་པའི་སྟོང་པ་ཉིད་དེས་ལྟ་བར་གྱུར་པ་རྣམས་སྟོང་པ་དང་།
en: Emptiness is empty of emptiness. Due to that emptiness, views are empty.

source: སྟོང་པ་ཉིད་གང་གིས་ལྟ་བར་གྱུར་པ་རྣམས་སྟོང་པའི་སྟོང་པ་ཉིད་དེས་ཆོས་ཐམས་ཅད་སྟོང་པར་འདི་ཤེས་ཤིང་ཤེས་པ་ལ་ལྷག་པའི་ང་རྒྱལ་ཡང་མེད་པ་གང་ཡིན་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྦྱོར་བ་ཡང་དག་པའོ། །
en: Likewise, due to the emptiness by which views are empty, all phenomena are empty. To understand this—without having special pride in that understanding—is the proper engagement of bodhisattvas.

source: ལྷའི་བུ་གཞན་ཡང་མཚན་མ་མེད་པ་ལ་རློམ་སེམས་མེད་པར་ཡང་སྦྱོར་ལ། །
en: “Moreover, divine being, bodhisattvas engage in the absence of marks without arrogance.

source: རྣམ་པར་རྟོག་པ་ཐམས་ཅད་དང་བྲལ་ཞིང་རྣམ་པར་རྟོག་པ་ལས་གྲོལ་བ་ཡང་མ་ཡིན་པ་ནི་མཚན་མ་མེད་པ་ལ་སྦྱོར་བ་སྟེ།
en: The absence of any thought, while also not being free from thoughts, is engagement in the absence of marks.

source: རྣམ་པར་རྟོག་པ་གང་གིས་མཚན་མ་མེད་པ་ལ་རྣམ་པར་རྟོག་པའི་རྣམ་པར་རྟོག་པ་དེ་ཡང་མཚན་མ་མེད་པ་དང་མཉམ་ཞིང་
en: The thought through which the absence of marks is conceived is the same as the absence of marks.

source: རྣམ་པར་རྟོག་པ་དེ་དང་མཚན་མ་མེད་པ་ཡང་མཚན་མ་མེད་པར་རྣམ་པར་རྟོག་པས་མཉམ་པར་ཤེས་ཏེ
en: Bodhisattvas understand the sameness of conceptual thinking and the absence of marks by means of conceptual thinking that is devoid of marks.

source: འདི་ཤེས་ཤིང་ཤེས་པ་ལ་ལྷག་པའི་ང་རྒྱལ་ཡང་མེད་པ་གང་ཡིན་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྦྱོར་བ་ཡང་དག་པའོ། །
en: To understand this—without having special pride in that understanding—is the proper engagement of bodhisattvas.

source: གཞན་ཡང་སྨོན་པ་མེད་པ་ལ་རློམ་སེམས་མེད་པར་ཡང་སྦྱོར་ལ། བསམས་བཞིན་དུ་སྐྱེ་བ་ཡོངས་སུ་འཛིན་པར་ཡང་སྦྱོར་ཏེ།
en: “Moreover, bodhisattvas engage in the absence of wishes without arrogance, yet they also engage in willfully taking birth.

source: དེ་སྨོན་ལམ་འདེབས་ཀྱང་སེམས་ཀྱིས་བག་ལ་ཉལ་བར་མི་བྱེད་ཅིང་།
en: Although they make aspirations, they do not form habitual thought patterns.

source: སྨོན་ལམ་འདེབས་ཀྱང་སྨོན་ལམ་གྱིས་རྒྱུ་བ་ཡང་མེད་ལ།
en: Although they make aspirations, they are not involved in discursive thoughts due to those aspirations.

source: སྐྱེ་ཡང་སྐྱེ་ཞིང་མཐའ་གཉི་གར་ལྟ་བ་དང་བྲལ་བ་འདི་ལྟ་སྟེ།
en: Birth after birth, they are free of the views of the two extremes.

source: ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པའི་ལྟ་བ་དང་བྲལ་བར་གྱུར་ཅིང་།
en: They are free of the views of clinging to me and mine.

source: སྐྱེ་ཡང་སྐྱེ་ལ་འཆི་འཕོ་དང་སྐྱེ་བ་དང་ཡང་བྲལ་བ་ཡིན་ཏེ།
en: Birth after birth, they are free of tumbling from death to rebirth.

source: ལྷའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྦྱོར་བ་ཡང་དག་པ་ཡང་དག་ཕུལ་ནི་གང་ཤེས་རབ་ཀྱི་ཤེས་པས་བརྩོན་པ་ཡང་མེད་ལ།
en: “Moreover, divine being, the most excellent proper engagement of bodhisattvas is as follows: “With their knowledge of insight, bodhisattvas do not exert themselves;

source: ཐབས་ཀྱི་ཤེས་པས་དགེ་བའི་ཆོས་ཐམས་ཅད་སྡུད་པར་ཡང་སྦྱོར་བ་དང་།
en: yet they engage in gathering all virtuous qualities, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་བདག་མེད་པ་དང་། སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གསོ་བ་མེད་པ་དང་། གང་ཟག་མེད་པར་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage in the lack of a self, the lack of a being, the lack of a life principle, the lack of a soul, and the lack of a person;

source: ཐབས་ཀྱི་ཤེས་པས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་ཡང་སྦྱོར་བ་དང་།
en: yet they also engage in the ripening of all beings, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་ཆོས་ཐམས་ཅད་བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པར་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage in neither accepting nor rejecting anything;

source: ཐབས་ཀྱི་ཤེས་པས་ཆོས་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པར་ཡང་སྦྱོར་བ་དང་།
en: yet they also engage in embracing all phenomena, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་སངས་རྒྱས་ཐམས་ཅད་དང་ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པར་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage in the indivisibility of all buddhas and the realm of phenomena;

source: ཐབས་ཀྱི་ཤེས་པས་སངས་རྒྱས་ཐམས་ཅད་ལ་བླ་མར་བྱ་བ་དང་། གུས་པར་བྱ་བ་དང་། མཆོད་པ་དང་། རིམ་གྲོ་བྱེད་པར་ཡང་སྦྱོར་བ་དང་།
en: yet they also engage in venerating, honoring, worshiping, and serving all buddhas, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ནམ་མཁའི་ཞིང་དུ་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage with all buddhafields as being the field of space;

source: ཐབས་ཀྱི་ཤེས་པས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡོངས་སུ་སྦྱོར་བའི་རྒྱན་ལ་སྦྱོར་བ་དང་།
en: yet they also fully engage with the ornamental array of qualities in the buddhafields, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་འཕགས་པ་ཐམས་ཅད་འདུས་མ་བྱས་ཀྱིས་རབ་ཏུ་ཕྱེ་བར་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage with all noble ones as being manifestations of the unconditioned nature;

source: ཐབས་ཀྱི་ཤེས་པས་འཕགས་པ་ཐམས་ཅད་ལ་བླ་མ་དང་། གུས་པ་དང་། རིམ་གྲོ་བྱེད་པར་ཡང་སྦྱོར་བ་དང་།
en: yet they also engage with all the noble ones by venerating, respecting, and serving them, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་སངས་རྒྱས་ཀྱི་སྐུ་ཟག་པ་མེད་པར་སོ་སོར་རྟོག་པར་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage with the buddha’s body by considering it to be undefiled;

source: ཐབས་ཀྱི་ཤེས་པས་མཚན་དང་དཔེ་བྱད་བཟང་པོ་དང་། རྒྱན་ལ་ཡང་སྦྱོར་བ་དང་།
en: yet they also engage with its major marks, minor marks, and adornments, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་འདུ་བྱེད་ཐམས་ཅད་མ་སྐྱེས་པ་དང་། མ་བྱུང་བར་སོ་སོར་རྟོག་པར་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage with all conditioned things by considering them to be unborn and unarisen;

source: ཐབས་ཀྱི་ཤེས་པས་བསམས་བཞིན་དུ་སྲིད་པར་སྐྱེ་བ་ཡོངས་སུ་འཛིན་པར་ཡང་སྦྱོར་བ་དང་།
en: yet they also engage with them by intentionally taking rebirth in existence, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པར་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage with emptiness, the absence of marks, and the absence of wishes;

source: ཐབས་ཀྱི་ཤེས་པས་ལྟ་བ་དང་རྣམ་པར་རྟོག་པ་དང་། སྨོན་ལམ་སྤང་བ་སྟོན་པར་ཡང་སྦྱོར་བ་དང་།
en: yet they also engage in teaching the abandonment of views, thoughts, and aspirations, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་མངོན་པར་ཤེས་པ་སྐྱེ་བ་མེད་པར་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage with the superknowledges by considering them to be unborn;

source: ཐབས་ཀྱི་ཤེས་པས་མངོན་པར་ཤེས་པ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་འཕྲུལ་བར་ཡང་སྦྱོར་བ་དང་།
en: yet they also engage with miraculous displays by means of all the superknowledges, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་མ་སྐྱེས་པ་དང་། མི་སྩོགས་པར་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage with the aggregates, elements, and sense sources as being unborn and uncompounded;

source: ཐབས་ཀྱི་ཤེས་པས་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཡོངས་སུ་འདོར་བར་ཡང་སྦྱོར་བ་དང་
en: yet they also engage in rejecting the aggregates, elements, and sense sources, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་སྲིད་པ་མྱ་ངན་ལས་འདས་པའི་རང་བཞིན་དུ་རྟོགས་པར་བྱེད་པར་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage with the understanding that existence has the nature of nirvāṇa;

source: ཐབས་ཀྱི་ཤེས་པས་འཁོར་བ་ན་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་ཡང་སྦྱོར་བ་དང་།
en: yet they also engage in ripening beings in saṃsāra, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་ཤེས་རབ་ཀྱི་མིག་ལ་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage with the eye of insight;

source: ཐབས་ཀྱི་ཤེས་པས་ལྷའི་མིག་མངོན་པར་བསྒྲུབ་པ་ལ་ཡང་སྦྱོར་བ་དང་།
en: yet they also engage in accomplishing the divine eye, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་ཆོས་བརྗོད་དུ་མེད་པར་ཁོང་དུ་ཆུད་པར་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage in the understanding that the Dharma is inexpressible;

source: ཐབས་ཀྱི་ཤེས་པས་ཡི་གེ་དང་ངེས་པའི་ཚིག་གིས་ཆོས་སྟོན་པར་ཡང་སྦྱོར་བ་དང་།
en: yet they also engage in teaching the Dharma by means of words and expressions, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་དོན་དང་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage in the discernment of meaning and doctrine;

source: ཐབས་ཀྱི་ཤེས་པས་ངེས་པའི་ཚིག་དང་སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་ཡང་སྦྱོར་བ་དང་།
en: yet they also engage in the discernment of expression and eloquence, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་སེམས་ཅན་གྱི་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་ཐམས་ཅད་ཤེས་པ་ལ་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage in knowing the capacities—both high and low—of all beings;

source: ཐབས་ཀྱི་ཤེས་པས་སོ་སོ་ཅི་རིག་པར་ཆོས་སྟོན་པར་ཡང་སྦྱོར་བ་དང་།
en: yet they also engage in teaching the Dharma appropriate to each being, through their knowledge of skillful means.

source: ཤེས་རབ་ཀྱི་ཤེས་པས་སེམས་ཅན་གྱི་སྤྱོད་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཁོང་དུ་ཆུད་པར་བྱེད་པར་ཡང་སྦྱོར་ལ།
en: “With their knowledge of insight, bodhisattvas engage in comprehending the 84,000 activities of beings;

source: ཐབས་ཀྱི་ཤེས་པས་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་དག་པར་སྟོན་པར་ཡང་སྦྱོར་བ་
en: yet they also teach the 84,000 collections of the Dharma, through their knowledge of skillful means.

source: འདི་ནི་ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྦྱོར་བ་ཡང་དག་པ་ཡང་དག་ཕུལ་ལོ། །
en: “This, divine being, is the most excellent proper engagement of bodhisattvas.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་སྦྱོར་བ་ཡང་དག་པ་འདི་བསྟན་པ་ན།
en: As youthful Mañjuśrī gave this teaching on proper engagement,

source: འཁོར་དེ་ལས་ལྷའི་བུ་བརྒྱད་སྟོང་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ། །
en: the intention to reach unexcelled and perfect awakening arose within eight thousand gods from that assembly,

source: བྱང་ཆུབ་སེམས་དཔའ་ལྔ་སྟོང་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ། །
en: and five thousand bodhisattvas developed acceptance that phenomena are unborn.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ། འཇམ་དཔལ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྦྱོར་བ་ཡང་དག་པ་འདི་ལེགས་པར་བཤད་པ་ལེགས་སོ་ཞེས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ། །
en: The Blessed One gave his approval to youthful Mañjuśrī saying, “Excellent, Mañjuśrī! You have explained the proper engagement of bodhisattvas well.”

source: འཇམ་དཔལ་ཁྱོད་ལ་དེ་བཞིན་གཤེགས་པས་གང་གི་ཕྱིར་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་པས་ཅི་ཁྱོད་དགའ་བར་འགྱུར་རམ།
en: “Mañjuśrī, were you pleased when the Thus-Gone One gave you his approval?”

source: ལྷའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གང་སྤྲུལ་པས་སྤྲུལ་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ན་སྤྲུལ་པ་དེ་ལ་ཅི་དགའ་བ་འགྱུར་བ་ལྟ་ཡོད་དམ།
en: “Divine being, tell me, when one emanation gives approval to another emanation, does that emanation become pleased?”

source: འཇམ་དཔལ་སྤྲུལ་པ་ལ་རྗེས་སུ་ཆགས་པ་ཡང་མེད། ཁོང་ཁྲོ་བ་ཡང་མེད་ན་དེ་ལ་དགའ་བར་འགྱུར་བ་ཅི་ཞིག་ཡོད།
en: “Mañjuśrī, if the emanation has no attachment or aversion, how could it become pleased?”

source: ལྷའི་བུ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་སྤྲུལ་པའི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་དེ། དེ་བཞིན་གཤེགས་པ་ཡང་དེའི་མཚན་ཉིད་ལ་འཇམ་དཔལ་ཡང་དེའི་མཚན་ཉིད་ཡིན་ན།
en: “Divine being, all phenomena have the inherent characteristic of being emanations, and so the Thus-Gone One and Mañjuśrī also have that characteristic.

source: དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བས་ཁོ་བོ་དགའ་བར་འགྱུར་དུ་ཅི་ཞིག་ཡོད།
en: Therefore, why would I become pleased by being praised?

source: ལྷའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། བྲག་ཅ་ནི་སྒྲ་སྙན་པ་དང་། མི་སྙན་པ་རྣམས་ལ་རྗེས་སུ་ཆགས་པར་ཡང་མི་འགྱུར།
en: By way of analogy, divine being, an echo does not become attached to pleasant or unpleasant sounds.

source: ཁོང་ཁྲོ་བར་ཡང་མི་འགྱུར་རོ། །
en: Nor does it become averse to them.

source: ལྷའི་བུ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ནི་བྲག་ཅའི་ངོ་བོ་ཉིད་ཀྱི་རང་བཞིན་ཏེ།
en: Divine being, in that way all phenomena have the inherent nature of an echo.

source: དེ་བཞིན་གཤེགས་པ་ཡང་དེའི་རང་བཞིན་འཇམ་དཔལ་ཡང་དེའི་རང་བཞིན་ཡིན་ན།
en: The Thus-Gone One and Mañjuśrī both have that nature.

source: དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བས་ཁོ་བོ་དགའ་བར་འགྱུར་དུ་ཅི་ཡོད།
en: So how could I become pleased by being praised?”

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པས་སུ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་།
en: “Mañjuśrī, to whom did the Thus-Gone One give his approval?”

source: ལྷའི་བུ་རྣམ་པར་ཤེས་པ་མི་གནས་པར་སྟོན་པ་དང་།
en: “Divine being, to one who teaches that consciousness is nonabiding;

source: བསྟན་པ་ཐམས་ཅད་ལ་སུའི་བློ་ཐོགས་པར་མི་འགྱུར་བ་དང་།
en: to one whose mind is unobstructed concerning all the teachings;

source: སུ་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་ཅན་དུ་འདུ་ཤེས་མི་འཇུག་པ་དང་།
en: to one who does not perceive any being as a being;

source: སུ་ཆོས་ཐམས་ཅད་ལ་ཆོས་སུ་འདུ་ཤེས་མི་འཇུག་པ་དང་།
en: to one who does not perceive any phenomenon as a phenomenon;

source: སུ་བསམ་པ་མྱ་ངན་ལས་འདས་པ་ལ་ཡང་གནས་ལ། སྦྱོར་བ་འཁོར་བ་ལ་ཡང་གནས་པ་དང་།
en: to one whose intention is set on nirvāṇa, while their activity is rooted in saṃsāra;

source: སུ་བདུད་ཀྱི་ལས་ཁོང་དུ་ཆུད་ནས་བདུད་ཀྱི་ལས་ཀྱང་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་སུ་ཤེས་ཤིང་།
en: to one who has understood the actions of Māra and knows the actions of Māra to be buddha activity;

source: སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ལ་མངོན་པར་ཞེན་ནསངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ཀྱང་བདུད་ཀྱི་ལས་སུ་ཤེས་པ་དེ་
en: and, moreover, to one who understands that if one becomes attached to buddha activity, it too becomes the activity of Māra.

source: ལྟ་བུའི་ཆོས་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ། ལྷའི་བུ་དེ་བཞིན་གཤེགས་པས་ལེགས་སོ་ཞེས་བྱ་བ་གནང་ངོ་། །
en: It is to a bodhisattva who is righteous in that way, divine being, that the Thus-Gone One gives his approval.”

source: འཇམ་དཔལ་ཅི་དེ་ལྟ་བུའི་ཆོས་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པས་ཁྱོད་ལ། ལེགས་སོ་ཞེས་བྱ་བ་གནང་ངམ།
en: “Mañjuśrī, why is it that because you are righteous in that way, the Thus-Gone One gives you his approval?”

source: ལྷའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གང་མཉམ་པ་ཉིད་དེ་ལ་མི་མཉམ་པ་གང་ཡང་ཡོད་དམ།
en: “Divine being, tell me, is there any difference within sameness?”

source: འཇམ་དཔལ་མཉམ་པ་ཉིད་ལ་མི་མཉམ་པ་གང་ཡང་མེད་དོ། །
en: “No, Mañjuśrī, there is no difference whatsoever within sameness.”
